
![](images/python_pandas.jpg)


---

# Pandas

- Basically used to do work like in excel.(You can think of pandas as an extremely powerful version of Excel, with a lot more features.)
- Pandas(Panel data)



### Topics discussed:-

* Introduction to Pandas and its Features
* Series
* DataFrames
    * selecting rows and columns (using `[]` or `loc/iloc attribute`)
    * Adding and removing Rows (using `[]` to add and `drop()` to remove)
    * Conditional statements on DataFrames
    * Setting and Resetting Indexes (use `set_index()` and `reset_index()`)
    * Missing Data (use `dropna()` to clean data and `fillna()` to fill missing data)
    * GroupBy (`groupby()`)
    * Merging,Joining,and Concatenating(`merge()`, `join()`, `concat()`)
    * Operations
    * Data Input and Output


## Features
- pandas - a powerful data analysis and manipulation library for Python  
- pandas is a Python package providing fast, flexible, and expressive data
structures designed to make working with "relational" or "labeled" data both
easy and intuitive. 


- It aims to be the fundamental high-level building block for
    doing practical,real worlddata analysis in Python.


Main Features
-------------

Here are just a few of the things that pandas does well:

  - `Easy handling of missing data` in floating point as well as non-floating
    point data.
  
  
  - `Size mutability`: columns can be inserted and deleted from DataFrame and
    higher dimensional objects.
    
    
  - `Automatic and explicit data alignment`: objects can be explicitly aligned
    to a set of labels, or the user can simply ignore the labels and let
    `Series`, `DataFrame`, etc. automatically align the data for you in
    computations.
  
  
  - `Powerful, flexible group by functionality to perform split-apply-combine
    operations on data sets`, for both aggregating and transforming data.
  
  
  - `Intelligent label-based slicing, fancy indexing, and subsetting of large
    data sets.`
  
  
  - `Intuitive merging and joining data sets.`
  
  
  - `Flexible reshaping and pivoting of data sets.`
  
  
  - `Robust IO tools for loading data from flat files` (CSV and delimited),
    Excel files, databases, and saving/loading data from the ultrafast HDF5
    format.


  - `Time series-specific functionality`: date range generation and frequency
    conversion, moving window statistics, moving window linear regressions,
    date shifting and lagging, etc.

In [3]:
import pandas as pd
import numpy as np

## Series and DataFrames are the main modules of Pandas Module we will use

# 1. pd.Series

- basically used to create a hashtable with key,value pair namely (index,data).
- A Series is very similar to a NumPy array (in fact it is built on top of the NumPy array object). What differentiates the NumPy array from a Series, is that a Series can have axis labels, meaning it can be indexed by a label, instead of just a number location. It also doesn't need to hold numeric data, it can hold any arbitrary Python Object.
- it can hold  any type of data even built_in_functions as well.

In [4]:
data = np.array([1,2,3,4])
label = np.array([0,1,2,3])
label_char = np.array(['shaurya', 'priyansh', 'mamta', 'mukesh'])
hash_table = pd.Series(data) # By default indices will be 0,1,2,3 and so on... 

# providing numbered-indexing as well
hash_table2 = pd.Series(data = data, index = label)


# providing custom-indexing as well
hash_table3 = pd.Series(data = data, index = label_char)


# providing dictionary d
d= {'shaurya':1, 'singhal':2, 'mukesh':3, 'mamta':4}
hash_table4 = pd.Series(d)

In [6]:
print(hash_table)
print('----------------')
print(hash_table2)
print('----------------')
print(hash_table3)
print('----------------')
print(hash_table4)
print('----------------')

0    1
1    2
2    3
3    4
dtype: int32
----------------
0    1
1    2
2    3
3    4
dtype: int32
----------------
shaurya     1
priyansh    2
mamta       3
mukesh      4
dtype: int32
----------------
shaurya    1
singhal    2
mukesh     3
mamta      4
dtype: int64
----------------

In [7]:
# saving functions
hash_fun = pd.Series(data = [sum,min,max,print,len])

In [8]:
hash_fun

0      <built-in function sum>
1      <built-in function min>
2      <built-in function max>
3    <built-in function print>
4      <built-in function len>
dtype: object

## Operations are then also done based off of index:

In [9]:
ser1 = pd.Series([1,2,3,4], index = ['USA', 'Germany','USSR', 'Japan'])

In [10]:
ser2 = pd.Series([1,2,5,4], index = ['USA', 'Germany','Italy', 'Japan'])

In [11]:
ser1 + ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [12]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [48]:
pd.Series?

# 2. DataFrames

- DataFrames are the workhorse of pandas and are directly inspired by the R programming language. `We can think of a DataFrame as a bunch of Series objects put together to share the same index(`combine various hashtables with same keys or indices`)`. Let's use pandas to explore this topic!

- we will show DataFrames being Series of Series and infact built on numpy ARRAYS


- DataFrames have (index,data,columns) in the order data,index,columns

In [207]:
from numpy.random import randn 
df = pd.DataFrame(data = randn(4,4), index=['A','B','C','D'], columns=['E','F','G','H'])

In [208]:
df

          E         F         G         H
A  0.740670 -1.238894 -0.110215  1.808262
B -0.601752 -0.633102  0.123729 -0.605571
C  0.957254  0.459426 -0.134496 -0.415723
D -0.888963  0.286333 -0.692374 -0.629792

###  (2a)Selecting/Indexing rows(use `loc/iloc attribute`) and colums(use `[]`)  of DataFrame

In [209]:
# if we look and select E-th column use:
print(df['E']) # selecting column of DataFrame
print('------')
print(type(df['E']))
# it is a pandas - Series

A    0.740670
B   -0.601752
C    0.957254
D   -0.888963
Name: E, dtype: float64
------
<class 'pandas.core.series.Series'>

In [210]:
# selecting row
# df['A']  # this is an error 

ref = df.loc
print(ref['A'])
print('---------')
type(ref['A'])
# this is also a pandas- Series

E    0.740670
F   -1.238894
G   -0.110215
H    1.808262
Name: A, dtype: float64
---------

pandas.core.series.Series

In [211]:
# above thing can be combined
print(df.loc['A'])

E    0.740670
F   -1.238894
G   -0.110215
H    1.808262
Name: A, dtype: float64

In [212]:
# can use iloc to select based on numerical index starting with 0 (no Surprise here :| )
print(df.iloc[0]) # same as df.loc['A']

E    0.740670
F   -1.238894
G   -0.110215
H    1.808262
Name: A, dtype: float64

#### Conclusion 
- DataFrames are basically Series of Series
- since Series are based on numpy ,DatatFrames are as well. lets call shape attribute to it

In [213]:
df.shape

(4, 4)

In [214]:
# we can select multiple columns/rows (pass list of columns/rows)as well ex-
df[['E','F']]

          E         F
A  0.740670 -1.238894
B -0.601752 -0.633102
C  0.957254  0.459426
D -0.888963  0.286333

In [215]:
df[['E','F']].loc[['C','D']]

          E         F
C  0.957254  0.459426
D -0.888963  0.286333

In [216]:
# or use iloc
df[['E','F']].iloc[[2,3]]

          E         F
C  0.957254  0.459426
D -0.888963  0.286333

In [219]:
# grabbing individuail element
df.loc['A']['E']

0.7406701583787232

# (2b)Adding and Removing colums/rows in DataFrames

In [78]:
# Adding
df

          E         F         G         H
A  0.107055 -0.856872 -1.107465 -0.069469
B -1.741066 -0.651183  0.111722  0.444997
C -1.150753 -0.368783  0.882894 -1.017265
D  0.991462  1.046418 -1.461521 -0.365615

In [79]:
df['new'] = df['E'] + df['F'] # remember hashtable(map in c++) ,this add new column to table

In [80]:
df

          E         F         G         H       new
A  0.107055 -0.856872 -1.107465 -0.069469 -0.749817
B -1.741066 -0.651183  0.111722  0.444997 -2.392248
C -1.150753 -0.368783  0.882894 -1.017265 -1.519535
D  0.991462  1.046418 -1.461521 -0.365615  2.037880

In [81]:

df.loc['new_row'] = df.loc['A'] + df.loc['B'] # adding row using loc/iloc attribute

In [82]:
df

                E         F         G         H       new
A        0.107055 -0.856872 -1.107465 -0.069469 -0.749817
B       -1.741066 -0.651183  0.111722  0.444997 -2.392248
C       -1.150753 -0.368783  0.882894 -1.017265 -1.519535
D        0.991462  1.046418 -1.461521 -0.365615  2.037880
new_row -1.634011 -1.508054 -0.995743  0.375528 -3.142065

In [84]:
# removing -> not inplace or do it by setting that inplace attribute True
df.drop('A', axis=0) # set axis to 0 for rows
# df.drop('E',axis=1) # set axis to 1 for columms

                E         F         G         H       new
B       -1.741066 -0.651183  0.111722  0.444997 -2.392248
C       -1.150753 -0.368783  0.882894 -1.017265 -1.519535
D        0.991462  1.046418 -1.461521 -0.365615  2.037880
new_row -1.634011 -1.508054 -0.995743  0.375528 -3.142065

In [85]:
df # see nothing is dropped ->??

                E         F         G         H       new
A        0.107055 -0.856872 -1.107465 -0.069469 -0.749817
B       -1.741066 -0.651183  0.111722  0.444997 -2.392248
C       -1.150753 -0.368783  0.882894 -1.017265 -1.519535
D        0.991462  1.046418 -1.461521 -0.365615  2.037880
new_row -1.634011 -1.508054 -0.995743  0.375528 -3.142065

In [86]:
# to Drop set inplace =True
df.drop('new',axis=1, inplace=True)

In [88]:
df # now new is removed

                E         F         G         H
A        0.107055 -0.856872 -1.107465 -0.069469
B       -1.741066 -0.651183  0.111722  0.444997
C       -1.150753 -0.368783  0.882894 -1.017265
D        0.991462  1.046418 -1.461521 -0.365615
new_row -1.634011 -1.508054 -0.995743  0.375528

In [89]:
# lets remove new_row as well
df.drop('new_row', inplace=True, axis=0)

In [91]:
df # back to Square One!!

          E         F         G         H
A  0.107055 -0.856872 -1.107465 -0.069469
B -1.741066 -0.651183  0.111722  0.444997
C -1.150753 -0.368783  0.882894 -1.017265
D  0.991462  1.046418 -1.461521 -0.365615

### (2c) Conditional Selection

An important feature of pandas is conditional selection using bracket notation, very similar to numpy:

In [92]:
df

          E         F         G         H
A  0.107055 -0.856872 -1.107465 -0.069469
B -1.741066 -0.651183  0.111722  0.444997
C -1.150753 -0.368783  0.882894 -1.017265
D  0.991462  1.046418 -1.461521 -0.365615

In [93]:
df>0

       E      F      G      H
A   True  False  False  False
B  False  False   True   True
C  False  False   True  False
D   True   True  False  False

In [94]:
df[df>0]

          E         F         G         H
A  0.107055       NaN       NaN       NaN
B       NaN       NaN  0.111722  0.444997
C       NaN       NaN  0.882894       NaN
D  0.991462  1.046418       NaN       NaN

In [96]:
df[df<1]

          E         F         G         H
A  0.107055 -0.856872 -1.107465 -0.069469
B -1.741066 -0.651183  0.111722  0.444997
C -1.150753 -0.368783  0.882894 -1.017265
D  0.991462       NaN -1.461521 -0.365615

In [97]:
df

          E         F         G         H
A  0.107055 -0.856872 -1.107465 -0.069469
B -1.741066 -0.651183  0.111722  0.444997
C -1.150753 -0.368783  0.882894 -1.017265
D  0.991462  1.046418 -1.461521 -0.365615

In [102]:
df[df['E']>0] # will select all columns where in E-th columns values are >0

          E         F         G         H
A  0.107055 -0.856872 -1.107465 -0.069469
D  0.991462  1.046418 -1.461521 -0.365615

In [106]:
# to select only F and G th column where Eth values are >0
df[df['E']>0][['F','G']] # why? --->>> since df[df['E']>0] this is also a Dataframes we can chain concept learn till now.

          F         G
A -0.856872 -1.107465
D  1.046418 -1.461521

#### For two conditions you can use | and & with parenthesis :(dont use `and` `or` as they are use for single elements not a series/array of elements)

In [121]:
# to show my point
df['E']>0

A     True
B    False
C    False
D     True
Name: E, dtype: bool

In [122]:
# to show my point
df['F']>1

A    False
B    False
C    False
D     True
Name: F, dtype: bool

In [123]:
# df[(df['E']>0) and (df['F'] > 1)] # is an error -> The truth value of a Series is ambiguous.  
df[(df['E']>0) & (df['F'] > 1)] # only Dth column is returned

          E         F         G         H
D  0.991462  1.046418 -1.461521 -0.365615

In [127]:
# similarly
# df[(df['E']>0) or (df['F'] > 1)] # error
df[(df['E']>0) | (df['F'] > 1)]

          E         F         G         H
A  0.107055 -0.856872 -1.107465 -0.069469
D  0.991462  1.046418 -1.461521 -0.365615

# (2d) Index setting(using set_index(value)) and Resetting(using reset_index())

In [150]:
df

               E         F         G         H
States
CA      0.107055 -0.856872 -1.107465 -0.069469
NY     -1.741066 -0.651183  0.111722  0.444997
WY     -1.150753 -0.368783  0.882894 -1.017265
OR      0.991462  1.046418 -1.461521 -0.365615

In [151]:
# Reset to default 0,1...n index
df.reset_index() # also use inplace=True to make effect permanent

  States         E         F         G         H
0     CA  0.107055 -0.856872 -1.107465 -0.069469
1     NY -1.741066 -0.651183  0.111722  0.444997
2     WY -1.150753 -0.368783  0.882894 -1.017265
3     OR  0.991462  1.046418 -1.461521 -0.365615

In [152]:
df # showing resetting was not inplace

               E         F         G         H
States
CA      0.107055 -0.856872 -1.107465 -0.069469
NY     -1.741066 -0.651183  0.111722  0.444997
WY     -1.150753 -0.368783  0.882894 -1.017265
OR      0.991462  1.046418 -1.461521 -0.365615

In [153]:
newind = 'CA NY WY OR'.split()
df['States'] = newind # adding new col

In [154]:
df

               E         F         G         H States
States
CA      0.107055 -0.856872 -1.107465 -0.069469     CA
NY     -1.741066 -0.651183  0.111722  0.444997     NY
WY     -1.150753 -0.368783  0.882894 -1.017265     WY
OR      0.991462  1.046418 -1.461521 -0.365615     OR

In [155]:
df.set_index('States') # setting different index !!! remenber it overwrittes original indexes!!! also by default not inplace

               E         F         G         H
States
CA      0.107055 -0.856872 -1.107465 -0.069469
NY     -1.741066 -0.651183  0.111722  0.444997
WY     -1.150753 -0.368783  0.882894 -1.017265
OR      0.991462  1.046418 -1.461521 -0.365615

In [147]:
df

          E         F         G         H States
A  0.107055 -0.856872 -1.107465 -0.069469     CA
B -1.741066 -0.651183  0.111722  0.444997     NY
C -1.150753 -0.368783  0.882894 -1.017265     WY
D  0.991462  1.046418 -1.461521 -0.365615     OR

In [156]:
df.set_index('States',inplace=True)

In [157]:
df

               E         F         G         H
States
CA      0.107055 -0.856872 -1.107465 -0.069469
NY     -1.741066 -0.651183  0.111722  0.444997
WY     -1.150753 -0.368783  0.882894 -1.017265
OR      0.991462  1.046418 -1.461521 -0.365615

## (2e) Missing Data( use `dropna()  and fillna()`) use `inplace=True` to make changes Permanent

In [161]:

df = pd.DataFrame({'A':[1,2,np.nan], 'B':[5,np.nan,np.nan],'C':[1,2,3]}) # passing dict to Dataframe make keys its column
# indexes and data being each cell data with rows indexed using 0,1,2,3,4

In [162]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [166]:
df.dropna() # drops row(bydefault axis = 0) with even a single NaN

     A    B  C
0  1.0  5.0  1

In [167]:
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [168]:
df.dropna(thresh=2) # to set minimum no of NaN's to be found to drop that row(axis=0) or col(axis=1)

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [174]:
df.fillna(value='FILL VALUE')

            A           B  C
0           1           5  1
1           2  FILL VALUE  2
2  FILL VALUE  FILL VALUE  3

In [176]:
df # not doing it inplace till now use inplace=True to do that

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [177]:
df['A']

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [178]:
df['A'].mean()

1.5

In [179]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# (2f) Groupby

The `groupby()` method allows you to group rows of data together and call aggregate functions

In [31]:
import pandas as pd
# Create dataframe
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [32]:
df = pd.DataFrame(data)

In [33]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

** Now you can use the .groupby() method to group rows together based off of a column name. For instance let's group based off of Company. This will create a DataFrameGroupBy object:**

In [34]:
df.groupby('Company')

You can save this object as a new variable:

In [35]:
by_comp = df.groupby("Company")

And then call aggregate methods off the object:

In [36]:
by_comp.mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [37]:
df.groupby('Company').mean()

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

More examples of aggregate methods:

In [38]:
by_comp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [39]:
by_comp.min()

          Person  Sales
Company
FB          Carl    243
GOOG     Charlie    120
MSFT         Amy    124

In [40]:
by_comp.max()

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [41]:
by_comp.count()

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [42]:
by_comp.describe()

                    Sales
Company
FB      count    2.000000
        mean   296.500000
        std     75.660426
        min    243.000000
        25%    269.750000
        50%    296.500000
        75%    323.250000
        max    350.000000
GOOG    count    2.000000
        mean   160.000000
        std     56.568542
        min    120.000000
        25%    140.000000
        50%    160.000000
        75%    180.000000
        max    200.000000
MSFT    count    2.000000
        mean   232.000000
        std    152.735065
        min    124.000000
        25%    178.000000
        50%    232.000000
        75%    286.000000
        max    340.000000

In [43]:
by_comp.describe().transpose()

Company    FB                                                         GOOG  \
        count   mean        std    min     25%    50%     75%    max count
Sales     2.0  296.5  75.660426  243.0  269.75  296.5  323.25  350.0   2.0

Company         ...                  MSFT                                   \
          mean  ...      75%    max count   mean         std    min    25%
Sales    160.0  ...    180.0  200.0   2.0  232.0  152.735065  124.0  178.0

Company
           50%    75%    max
Sales    232.0  286.0  340.0

[1 rows x 24 columns]

In [44]:
by_comp.describe().transpose()['GOOG']

       count   mean        std    min    25%    50%    75%    max
Sales    2.0  160.0  56.568542  120.0  140.0  160.0  180.0  200.0

# Operations

There are lots of operations with pandas that will be really useful to you, but don't fall into any distinct category. Let's show them here in this lecture:

In [52]:
import pandas as pd
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Info on Unique Values

In [53]:
df['col2'].unique()

array([444, 555, 666])

In [54]:
df['col2'].nunique()

3

In [55]:
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

### Selecting Data

In [56]:
#Select from DataFrame using criteria from multiple columns
newdf = df[(df['col1']>2) & (df['col2']==444)]

In [57]:
newdf

   col1  col2 col3
3     4   444  xyz

### Applying Functions

In [58]:
def times2(x):
    return x*2

In [59]:
df['col1'].apply(times2)

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [60]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [61]:
df['col1'].sum()

10

** Permanently Removing a Column**

In [62]:
del df['col1']

In [63]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Get column and index names: **

In [64]:
df.columns

Index(['col2', 'col3'], dtype='object')

In [65]:
df.index

RangeIndex(start=0, stop=4, step=1)

** Sorting and Ordering a DataFrame:**

In [66]:
df

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

In [67]:
df.sort_values(by='col2') #inplace=False by default

   col2 col3
0   444  abc
3   444  xyz
1   555  def
2   666  ghi

** Find Null Values or Check for Null Values**

In [68]:
df.isnull()

    col2   col3
0  False  False
1  False  False
2  False  False
3  False  False

In [69]:
# Drop rows with NaN Values
df.dropna()

   col2 col3
0   444  abc
1   555  def
2   666  ghi
3   444  xyz

** Filling in NaN values with something else: **

In [71]:
import numpy as np

In [72]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],
                   'col2':[np.nan,555,666,444],
                   'col3':['abc','def','ghi','xyz']})
df.head()

   col1   col2 col3
0   1.0    NaN  abc
1   2.0  555.0  def
2   3.0  666.0  ghi
3   NaN  444.0  xyz

In [75]:
df.fillna('FILL')

   col1  col2 col3
0     1  FILL  abc
1     2   555  def
2     3   666  ghi
3  FILL   444  xyz

In [89]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [90]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [91]:
df.pivot_table(values='D',index=['A', 'B'],columns=['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Great Job!

# Data Input and Output

This notebook is the reference code for getting input and output, pandas can read a variety of file types using its pd.read_ methods. Let's take a look at the most common data types:

In [1]:
import numpy as np
import pandas as pd

## CSV

### CSV Input

In [25]:
df = pd.read_csv('example')
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### CSV Output

In [24]:
df.to_csv('example',index=False)

## Excel
Pandas can read and write excel files, keep in mind, this only imports data. Not formulas or images, having images or macros may cause this read_excel method to crash.

### Excel Input

In [35]:
pd.read_excel('Excel_Sample.xlsx',sheetname='Sheet1')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

### Excel Output

In [33]:
df.to_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

## HTML

You may need to install htmllib5,lxml, and BeautifulSoup4. In your terminal/command prompt run:

    conda install lxml
    conda install html5lib
    conda install BeautifulSoup4

Then restart Jupyter Notebook.
(or use pip install if you aren't using the Anaconda Distribution)

Pandas can read table tabs off of html. For example:

### HTML Input

Pandas read_html function will read tables off of a webpage and return a list of DataFrame objects:

In [5]:
df = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [7]:
df[0]

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date,Loss Share Type,Agreement Terminated,Termination Date
0,First CornerStone Bank,King of Prussia,PA,35312,First-Citizens Bank & Trust Company,"May 6, 2016","July 12, 2016",none,NaN,NaN
1,Trust Company Bank,Memphis,TN,9956,The Bank of Fayette County,"April 29, 2016","August 4, 2016",none,NaN,NaN
2,North Milwaukee State Bank,Milwaukee,WI,20364,First-Citizens Bank & Trust Company,"March 11, 2016","June 16, 2016",none,NaN,NaN
3,Hometown National Bank,Longview,WA,35156,Twin City Bank,"October 2, 2015","April 13, 2016",none,NaN,NaN
4,The Bank of Georgia,Peachtree City,GA,35259,Fidelity Bank,"October 2, 2015","April 13, 2016",none,NaN,NaN
5,Premier Bank,Denver,CO,34112,"United Fidelity Bank, fsb","July 10, 2015","July 12, 2016",none,NaN,NaN
6,Edgebrook Bank,Chicago,IL,57772,Republic Bank of Chicago,"May 8, 2015","July 12, 2016",none,NaN,NaN
7,Doral BankEn Espanol,San Juan,PR,32102,Banco Popular de Puerto Rico,"February 27, 2015","May 13, 2015",none,NaN,NaN
8,Capitol City Bank & Trust Company,Atlanta,GA,33938,First-Citizens Bank & Trust Company,"February 13, 2015","April 21, 2015",none,NaN,NaN
9,Highland Community Bank,Chicago,IL,20290,"United Fidelity Bank, fsb","January 23, 2015","April 21, 2015",none,NaN,NaN
10,First National Bank of Crestview,Crestview,FL,17557,First NBC Bank,"January 16, 2015","January 15, 2016",none,NaN,NaN
11,Northern Star Bank,Mankato,MN,34983,BankVista,"December 19, 2014","January 6, 2016",none,NaN,NaN
12,"Frontier Bank, FSB D/B/A El Paseo Bank",Palm Desert,CA,34738,"Bank of Southern California, N.A.","November 7, 2014","January 6, 2016",none,NaN,NaN
13,The National Republic Bank of Chicago,Chicago,IL,916,State Bank of Texas,"October 24, 2014","January 6, 2016",none,NaN,NaN
14,NBRS Financial,Rising Sun,MD,4862,Howard Bank,"October 17, 2014","March 26, 2015",none,NaN,NaN
15,"GreenChoice Bank, fsb",Chicago,IL,28462,"Providence Bank, LLC","July 25, 2014","July 28, 2015",none,NaN,NaN
16,Eastside Commercial Bank,Conyers,GA,58125,Community & Southern Bank,"July 18, 2014","July 11, 2016",none,NaN,NaN
17,The Freedom State Bank,Freedom,OK,12483,Alva State Bank & Trust Company,"June 27, 2014","March 25, 2016",none,NaN,NaN
18,Valley Bank,Fort Lauderdale,FL,21793,"Landmark Bank, National Association","June 20, 2014","June 29, 2015",none,NaN,NaN
19,Valley Bank,Moline,IL,10450,Great Southern Bank,"June 20, 2014","June 26, 2015",none,NaN,NaN
20,Slavie Federal Savings Bank,Bel Air,MD,32368,"Bay Bank, FSB","May 30, 2014","June 15, 2015",none,NaN,NaN
21,Columbia Savings Bank,Cincinnati,OH,32284,"United Fidelity Bank, fsb","May 23, 2014","May 28, 2015",none,NaN,NaN
22,AztecAmerica Bank En Espanol,Berwyn,IL,57866,Republic Bank of Chicago,"May 16, 2014","July 18, 2014",none,NaN,NaN
23,Allendale County Bank,Fairfax,SC,15062,Palmetto State Bank,"April 25, 2014","July 18, 2014",none,NaN,NaN
24,Vantage Point Bank,Horsham,PA,58531,First Choice Bank,"February 28, 2014","March 3, 2015",none,NaN,NaN
25,"Millennium Bank, National Association",Sterling,VA,35096,WashingtonFirst Bank,"February 28, 2014","March 03, 2015",none,NaN,NaN
26,Syringa Bank,Boise,ID,34296,Sunwest Bank,"January 31, 2014","April 12, 2016",none,NaN,NaN
27,The Bank of Union,El Reno,OK,17967,BancFirst,"January 24, 2014","March 25, 2016",none,NaN,NaN
28,DuPage National Bank,West Chicago,IL,5732,Republic Bank of Chicago,"January 17, 2014","February 19, 2015",none,NaN,NaN
29,"Texas Community Bank, National Association",The Woodlands,TX,57431,"Spirit of Texas Bank, SSB","December 13, 2013","December 29, 2014",none,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...
515,"ANB Financial, NA",Bentonville,AR,33901,Pulaski Bank and Trust Company,"May 9, 2008","August 28, 2012",none,NaN,NaN
516,Hume Bank,Hume,MO,1971,Security Bank,"March 7, 2008","August 28, 2012",none,NaN,NaN
517,Douglass National Bank,Kansas City,MO,24660,Liberty Bank and Trust Company,"January 25, 2008","October 26, 2012",none,NaN,NaN
518,Miami Valley Bank,Lakeview,OH,16848,The Citizens Banking Company,"October 4, 2007","August 28, 2012",none,NaN,NaN
519,NetBank,Alpharetta,GA,32575,ING DIRECT,"September 28, 2007","August 28, 2012",none,NaN,NaN
520,Metropolitan Savings Bank,Pittsburgh,PA,35353,Allegheny Valley Bank of Pittsburgh,"February 2, 2007","October 27, 2010",none,NaN,NaN
521,Bank of Ephraim,Ephraim,UT,1249,Far West Bank,"June 25, 2004","April 9, 2008",none,NaN,NaN
522,Reliance Bank,White Plains,NY,26778,Union State Bank,"March 19, 2004","April 9, 2008",none,NaN,NaN
523,Guaranty National Bank of Tallahassee,Tallahassee,FL,26838,Hancock Bank of Florida,"March 12, 2004","June 5, 2012",none,NaN,NaN
524,Dollar Savings Bank,Newark,NJ,31330,No Acquirer,"February 14, 2004","April 9, 2008",none,NaN,NaN
525,Pulaski Savings Bank,Philadelphia,PA,27203,Earthstar Bank,"November 14, 2003","July 22, 2005",none,NaN,NaN
526,First National Bank of Blanchardville,Blanchardville,WI,11639,The Park Bank,"May 9, 2003","June 5, 2012",none,NaN,NaN
527,Southern Pacific Bank,Torrance,CA,27094,Beal Bank,"February 7, 2003","October 20, 2008",none,NaN,NaN
528,Farmers Bank of Cheneyville,Cheneyville,LA,16445,Sabine State Bank & Trust,"December 17, 2002","October 20, 2004",none,NaN,NaN
529,Bank of Alamo,Alamo,TN,9961,No Acquirer,"November 8, 2002","March 18, 2005",none,NaN,NaN
530,AmTrade International BankEn Espanol,Atlanta,GA,33784,No Acquirer,"September 30, 2002","September 11, 2006",none,NaN,NaN
531,Universal Federal Savings Bank,Chicago,IL,29355,Chicago Community Bank,"June 27, 2002","April 9, 2008",none,NaN,NaN
532,Connecticut Bank of Commerce,Stamford,CT,19183,Hudson United Bank,"June 26, 2002","February 14, 2012",none,NaN,NaN
533,New Century Bank,Shelby Township,MI,34979,No Acquirer,"March 28, 2002","March 18, 2005",none,NaN,NaN
534,Net 1st National Bank,Boca Raton,FL,26652,Bank Leumi USA,"March 1, 2002","April 9, 2008",none,NaN,NaN
535,"NextBank, NA",Phoenix,AZ,22314,No Acquirer,"February 7, 2002","February 5, 2015",none,NaN,NaN
536,Oakwood Deposit Bank Co.,Oakwood,OH,8966,The State Bank & Trust Company,"February 1, 2002","October 25, 2012",none,NaN,NaN
537,Bank of Sierra Blanca,Sierra Blanca,TX,22002,The Security State Bank of Pecos,"January 18, 2002","November 6, 2003",none,NaN,NaN
538,"Hamilton Bank, NAEn Espanol",Miami,FL,24382,Israel Discount Bank of New York,"January 11, 2002","September 21, 2015",none,NaN,NaN
539,Sinclair National Bank,Gravette,AR,34248,Delta Trust & Bank,"September 7, 2001","February 10, 2004",none,NaN,NaN
540,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001","August 19, 2014",none,NaN,NaN
541,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001","November 18, 2002",none,NaN,NaN
542,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001","February 18, 2003",none,NaN,NaN
543,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000","March 17, 2005",none,NaN,NaN
544,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000","March 17, 2005",none,NaN,NaN

____

_____
_____
# SQL (Optional)

* Note: If you are completely unfamiliar with SQL you can check out my other course: "Complete SQL Bootcamp" to learn SQL.

The pandas.io.sql module provides a collection of query wrappers to both facilitate data retrieval and to reduce dependency on DB-specific API. Database abstraction is provided by SQLAlchemy if installed. In addition you will need a driver library for your database. Examples of such drivers are psycopg2 for PostgreSQL or pymysql for MySQL. For SQLite this is included in Pythons standard library by default. You can find an overview of supported drivers for each SQL dialect in the SQLAlchemy docs.


If SQLAlchemy is not installed, a fallback is only provided for sqlite (and for mysql for backwards compatibility, but this is deprecated and will be removed in a future version). This mode requires a Python database adapter which respect the Python DB-API.

See also some cookbook examples for some advanced strategies.

The key functions are:

* read_sql_table(table_name, con[, schema, ...])	
    * Read SQL database table into a DataFrame.
* read_sql_query(sql, con[, index_col, ...])	
    * Read SQL query into a DataFrame.
* read_sql(sql, con[, index_col, ...])	
    * Read SQL query or database table into a DataFrame.
* DataFrame.to_sql(name, con[, flavor, ...])	
    * Write records stored in a DataFrame to a SQL database.

In [36]:
from sqlalchemy import create_engine

In [37]:
engine = create_engine('sqlite:///:memory:')

In [40]:
df.to_sql('data', engine)

In [42]:
sql_df = pd.read_sql('data',con=engine)

In [43]:
sql_df

   index   a   b   c   d
0      0   0   1   2   3
1      1   4   5   6   7
2      2   8   9  10  11
3      3  12  13  14  15

# Great Job!